

HITBOX_DATA = {

    "wasd": {
        "front_hand": {
            # frame : (ox, oy, w, h)
            2: (55, 10, 50, 32),  # 초반 타격
            3: (85, 12, 55, 35),  # 중간 타격
            4: (115, 12, 60, 38),  # 최종 타격
        },

        "rear_hand": {
            2: (75, 15, 55, 35),  # 시작 타격
            3: (115, 20, 70, 40)
        },

        "uppercut": {
            4: (50, 105, 55, 95),
        },
    },

    # ==========================
    #  P2 (controls = "arrows")
    # ==========================
    "arrows": {

        # 앞손(front_hand)
        "front_hand": {
            2: (60,  15, 60, 35),
            3: (78,  20, 60, 35),
        },

        # 뒷손(rear_hand)
        "rear_hand": {
            3: (70,  20, 65, 40),
        },

        # 어퍼컷
        "uppercut": {
            4: (35, 65, 45, 75),
        },
    }
}
